export default {
  storyList: [],
  story: {
    source: "热门内容, 来自: 互联网",
    title: "可以要求天眼查删除公司信息吗？",
    titleLink: "/question/45818142/answer/333873846",
    text:
      "<span class=''>无论如何我感谢天眼查让我在找工作的时候心里多了一份底气也让我识破了装逼的渣男和假装白富美的绿茶婊他们以为我什么也不懂抠门又土气于是伪装一副上流社会的样子可惜呀可惜被我一查就识破了<br>感谢天眼查<span><a class='user-link'target='_blank'href='//www.zhihu.com/people/fc1e8ef4a24b7220a62f53e26c0a951e'>@天眼查</a></span><span><a class='user-link'target='_blank'href='//www.zhihu.com/people/e7876117a1c06dac9eee94228c1ea443'>@柳超天眼查CEO</a></span><br>————————————————————<br>为了让评论区的几位有故事下酒，我来详细说说我和天眼查之间的故事，大学毕业后做了几份不咸不淡的工作，钱没赚几个倒是上了不少当，后来好像是在网页下边还是在什么地方看到过天眼查的广告，于是找工作之前都会先去网站上查查这个公司是个什么水平选手，筛选掉很多皮包公司（很可能有误伤，但是那个情况下没有什么经验，只能宁杀错不放过了）。<br>在这里和刚踏入社会的同学分享一些经验，如果你在找工作时拿不准主意，可以先去网上搜一搜，度娘虽然坑，但是你把公司名+骗子一起搜还是会给你很多惊喜的。<br>渣男的故事其实很俗套，就是在社交软件上有人说自己是XX企业XX人，外表也很光鲜亮丽，朋友圈种种豪车名表，但是实际一搜索根本不是这样，渣有很多种，我觉得不真诚还装逼也算一种渣，可能在这一点上大家的看法都不相同。<br>至于假装白富美的绿茶婊，故事经过同上，但是我现在也拿不准，毕竟一个大企业盘根错节关系复杂我无法想象，也没有实锤，但是只要人不犯我，她装逼与我何干？徒增笑料耳。<br>可能大家都想看我们撕逼的过程，但其实只有一个人我是真正意义上把他给识破了，此人是某某大学的学生，和我的美女同事说自己在北京某处与朋友合开一律师事务所，履历金光闪闪，和同事说自己是本地人（此处无歧视，只是同事的择偶标准就是想找本地人）后来感觉此人不靠谱，拿到他的姓名和大学后，搜索了一番，连他大学时期参加校园歌手大赛的照片都搜出来了，不是本地人，过去的经历也有吹嘘之处，我又去北京司法局，和天眼查网站以及专门查律所的网站搜索此人信息，什么都没有，所以善用搜素引擎，注意保护个人隐私，如果有什么事不想让别人知道，放在心里，不要告诉任何人，也别匿名发到什么地方，这个世界只要有心什么都可以查到。<br>后边有点跑题了，但是还是感谢天眼查，希望可以在法律的条款里更完善，让初出社会的小白们多一分对这个世界的底气。</span>",
    authorNickname: "李小粥",
    authorlink: "//www.zhihu.com/people/aaronli-yu-er",
    authorHeadImg:
      "https://pic4.zhimg.com/50/v2-49466d8072d9f087bec9654931960424_s.jpg",
    authorIntroduce:
      "资深产品经理，公众号[喝粥小爷]。上海交大非典型理工男，文章写得比代码好。",
    category: ""
  }
};
